app/controllers/authors_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    @author = Author.find(1)