app/controllers/posts_controller.rb

	def create
	  @post = Post.new(title: params[:post][:title], description: params[:post][:description], author_id: 1)
	  @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?)  [["title", "Ruby"], ["description", "I love Ruby"], ["created_at", "2020-04-03 01:26:41.456254"], ["updated_at", "2020-04-03 01:26:41.456254"], ["author_id", 1]]